Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерииНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>СерийныйНомер</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <comment>(Регл) Номер ГТД по умолчанию</comment>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_УдостоверениеКачества</name>
    <type>
      <types>DocumentRef.абс_СертификатНаТовары</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_УдостоверенияКачестваТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_МассаПартии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_КоличествоПартии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_МассоваяДоляВлаги</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_МассоваяДоляМеталлич</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_МассоваяДоляМинеральныхПримесей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ПосторонниеПримесиИВредители</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_МассаТаблетки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_УсловияХранения</name>
    <type>
      <types>CatalogRef.КодыЗонХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_массаНетто</name>
    <comment>Нетто ед. фасовки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_НТД</name>
    <type>
      <types>CatalogRef.Лео_НТД</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_номвходконтроля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_АктНесоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_номерконверта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_КодЗоныХранения</name>
    <type>
      <types>CatalogRef.Лео_КодЗоныХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_МассаКапсулы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_МассаСодержимогоКапсулы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ЦветСодержимого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1020</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Высота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Диаметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_МассаТаблетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ФормаРазмеры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ГотовностьБлюд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ПолнаяРастворимость</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_КонтрольОККПройден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОрганолептикаТУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ФормаРазмерыТУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_МассоваяДоляВлагиТУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ВидСерии</name>
    <type>
      <types>CatalogRef.Лео_видыСерий</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ДатаВыпуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>абс_УдостоверенияКачества</name>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>DocumentRef.абс_СертификатНаТовары</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Лео_СерииКомплектующих</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Catalogs/СерииНоменклатуры/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция устанавливает новое наименование серии по значениям реквизитов.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Строка - сформированное наименование.
//
Функция СформироватьНаименование() Экспорт

	Строка = "";

	Если ЗначениеЗаполнено(СерийныйНомер) Тогда
		Строка = Строка + СерийныйНомер + ", ";
	КонецЕсли;

	//АБС ВСТАВКА 37494  23.01.2014 11:39:50  Фролов
	Если ЗначениеЗаполнено(абс_ДатаПроизводства) Тогда
		Строка = Строка + Формат(абс_ДатаПроизводства,"ДФ=""дд.ММ.гггг""") + ", ";
	//АБС ВСТАВКА   26.03.2014 11:30:35  Балашенко
	ИначеЕсли ЗначениеЗаполнено(абс_ДатаУпаковки) Тогда
		Строка = Строка + Формат(абс_ДатаУпаковки,"ДФ=""дд.ММ.гггг""") + ", ";
	//АБС ВСТАВКА  КОНЕЦ	
	КонецЕсли;	
	//АБС ВСТАВКА 37494 КОНЕЦ 
	
	//АБС ИЗМЕНЕНИЕ 37494  23.01.2014 11:40:20  Фролов
	//Если ЗначениеЗаполнено(СрокГодности) Тогда
	//	Строка = Строка + Формат(СрокГодности,"ДФ=""дд.ММ.гггг""") + ", ";
	//КонецЕсли;
	//АБС ИЗМЕНЕНИЕ 37494 КОНЕЦ 

	//АБС ИЗМЕНЕНИЕ   26.03.2014 11:28:59  Балашенко
	//Если ЗначениеЗаполнено(НомерГТД) Тогда
	//	Строка = Строка + СокрЛП(НомерГТД.Код) + ", ";
	//КонецЕсли;

	//Если ЗначениеЗаполнено(СтранаПроисхождения) Тогда
	//	Строка = Строка + СтранаПроисхождения.Наименование + ", ";
	//КонецЕсли;
	//АБС ИЗМЕНЕНИЕ  КОНЕЦ

	Строка = Лев(Строка, СтрДлина(Строка) - 2);

	Если ПустаяСтрока(Строка) Тогда
		Строка = "<Свойства не назначены>";
	КонецЕсли;

	Возврат Строка;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		
		ОсновноеИзображение = Неопределено;
		//ЛЕО Зароднюк ВВ
		//При копировании очищаем вкладку Удоставерения качества и Сертификация 
		абс_УдостоверенияКачества.Очистить();
		абс_УдостоверениеКачества	= Документы.абс_СертификатНаТовары.ПустаяСсылка(); 
		абс_УдостоверенияКачестваТекст	=	"";
		Лео_НТД					=	Справочники.Лео_НТД.ПустаяСсылка();
		Лео_номвходконтроля		=	"";
		Лео_АктНесоответствия	=	"";
		Лео_номерконверта		=	"";
		Лео_КодЗоныХранения		=	Справочники.Лео_КодЗоныХранения.ПустаяСсылка();
		//ЛЕО Зароднюк ВВ
	КонецЕсли;
	
КонецПроцедуры
// Процедура вызывается перед записью элемента справочника.
//

Процедура ПередЗаписью(Отказ)

	// Проверим можно ли изменять реквизиты договора.
	// Проверка осуществляется только если записывается уже существующий договор
	Если НЕ ОбменДанными.Загрузка И НЕ ЭтоНовый() Тогда

		// Проверим возможность смены способа ведения взаиморасчетов и валюты взаиморасчетов
		Если НомерГТД <> Ссылка.НомерГТД
		 ИЛИ СтранаПроисхождения <> Ссылка.СтранаПроисхождения Тогда

			Если ПолныеПрава.СерииНоменклатуры_СуществуютСсылки(Ссылка) Тогда

				Сообщить("Существуют документы, проведенные по серии """ + Наименование + """.
						 |Реквизиты ""Номер ГТД"" и ""Страна происхождения"" не могут быть изменены, элемент не записан.", 
						 СтатусСообщения.Важное);
				Отказ = Истина;

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;
	
	//АБС ВСТАВКА   25.03.2014 9:00:30  Балашенко
	абс_ПроверитьДубльСерий(Отказ);
	//АБС ВСТАВКА  КОНЕЦ
	
#Если Клиент Тогда
	//Зароднюк В.   22.08.2025
	Если Владелец.ВидНоменклатуры=Справочники.ВидыНоменклатуры.НайтиПоКоду("000000004") 
		ИЛИ Владелец.ВидНоменклатуры=Справочники.ВидыНоменклатуры.НайтиПоКоду("000000003") Тогда
		Если НЕ ЗначениеЗаполнено(абс_ДатаПроизводства) ИЛИ НЕ ЗначениеЗаполнено(абс_ДатаПроизводства) Тогда 
			Предупреждение("Для записи серии нменклатуры поля -Дата производства- и -Срок годности- обязательны к заполнению");
			Отказ	=	Истина;	
		КонецЕсли;
	КонецЕсли;
#КонецЕсли
КонецПроцедуры // ПередЗаписью()

//АБС ВСТАВКА   25.03.2014 9:09:35  Балашенко
Процедура абс_ПроверитьДубльСерий(Отказ)
	
	// {ZAA
	Если Владелец.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000002") тогда // Материал
		 возврат; // не проверяем на дубли		
	КонецЕсли;	
	// ZAA}
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СерииНоменклатуры.Ссылка,
	|	СерииНоменклатуры.СрокГодности,
	|	СерииНоменклатуры.Лео_ДатаВыпуска
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.абс_ДатаПроизводства = &абс_ДатаПроизводства
	|	И НЕ СерииНоменклатуры.Ссылка = &Ссылка
	|	И СерииНоменклатуры.Владелец = &Владелец
	|	И СерииНоменклатуры.СрокГодности = &СрокГодности
	|	И СерииНоменклатуры.Наименование = &Наименование
	|	И СерииНоменклатуры.Лео_ДатаВыпуска = &Лео_ДатаВыпуска";
	Запрос.УстановитьПараметр("абс_ДатаПроизводства",абс_ДатаПроизводства);
	Запрос.УстановитьПараметр("СрокГодности",СрокГодности);// ZAA
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Наименование", Наименование); //ZAA Упаковка допоставка
    Запрос.УстановитьПараметр("Лео_ДатаВыпуска",Лео_ДатаВыпуска);
	
	Если ЭтоНовый() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И НЕ СерииНоменклатуры.Ссылка = &Ссылка", "" );
	Иначе
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("У номенклатуры " + Владелец +" уже существует серия " + Выборка.Ссылка + "  с датой производства " + Формат(абс_ДатаПроизводства, "ДФ=дд.ММ.гггг")+ "  с датой выпуска " + Формат(Лео_ДатаВыпуска, "ДФ=дд.ММ.гггг"));
		//Отказ = Истина;
	КонецЕсли;

КонецПроцедуры
//АБС ВСТАВКА  КОНЕЦ

//АБС ВСТАВКА 37494  23.01.2014 11:41:13  Фролов
Процедура ЗаполнитьСрокГодности() Экспорт
	
	Если НЕ ЗначениеЗаполнено(абс_ДатаПроизводства) Тогда
		СрокГодности = Неопределено;
		Возврат;
	КонецЕсли;
	
	ПолныйСрокГодностиНоменклатуры = 0;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, 0) КАК ПолныйСрокГодностиНоменклатуры
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &СвойствоПолныйСрокГодности
	|	И ЗначенияСвойствОбъектов.Объект = &Номенклатура");
	
	Запрос.УстановитьПараметр("СвойствоПолныйСрокГодности", ПланыВидовХарактеристик.СвойстваОбъектов.абс_ПолныйСрокГодностиТовара);
	Запрос.УстановитьПараметр("Номенклатура", Владелец);

	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда		
		ПолныйСрокГодностиНоменклатуры = Выборка.ПолныйСрокГодностиНоменклатуры;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолныйСрокГодностиНоменклатуры) Тогда
		СрокГодности = ДобавитьМесяц(абс_ДатаПроизводства, ПолныйСрокГодностиНоменклатуры);
	иначе	     ///Никитин 27.08.2018
		СрокГодности = ДобавитьМесяц(абс_ДатаПроизводства, Лео_СрокГодности);
	
		
		
	КонецЕсли;
	///никитин      если Срок годности задан в днях то пересчитывает через дни
	ПолныйСрокГодностиНоменклатуры = 0;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, 0) КАК ПолныйСрокГодностиНоменклатуры
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &СвойствоПолныйСрокГодности
	|	И ЗначенияСвойствОбъектов.Объект = &Номенклатура");
	
	Запрос.УстановитьПараметр("СвойствоПолныйСрокГодности", ПланыВидовХарактеристик.СвойстваОбъектов.лео_ПолныйСрокГодностиПолуфабрикатыДни);
	Запрос.УстановитьПараметр("Номенклатура", Владелец);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда		
		ПолныйСрокГодностиНоменклатуры = Выборка.ПолныйСрокГодностиНоменклатуры;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПолныйСрокГодностиНоменклатуры) Тогда
		СрокГодности = абс_ДатаПроизводства+ (ПолныйСрокГодностиНоменклатуры*3600*24);
	КонецЕсли;

	
	
	
	
	
	
КонецПроцедуры
//АБС ВСТАВКА 37494 КОНЕЦ 

//АБС ВСТАВКА 38854  13.02.2014 10:13:20  Шамов
Процедура ЗаполнитьДатуПроизводстваПоСрокуГодности() Экспорт

	Если НЕ ЗначениеЗаполнено(СрокГодности) Тогда
		абс_ДатаПроизводства = Неопределено;
		Возврат;
	КонецЕсли;
	
	ПолныйСрокГодностиНоменклатуры = 0;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, 0) КАК ПолныйСрокГодностиНоменклатуры
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &СвойствоПолныйСрокГодности
	|	И ЗначенияСвойствОбъектов.Объект = &Номенклатура");
	
	Запрос.УстановитьПараметр("СвойствоПолныйСрокГодности", ПланыВидовХарактеристик.СвойстваОбъектов.абс_ПолныйСрокГодностиТовара);
	Запрос.УстановитьПараметр("Номенклатура", Владелец);

	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда		
		ПолныйСрокГодностиНоменклатуры = Выборка.ПолныйСрокГодностиНоменклатуры;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолныйСрокГодностиНоменклатуры) Тогда
		абс_ДатаПроизводства = ДобавитьМесяц(СрокГодности, -ПолныйСрокГодностиНоменклатуры);
	КонецЕсли;
	
КонецПроцедуры
//АБС ВСТАВКА 38854 КОНЕЦ
